In [12]:
import pandas as pd
import seaborn as srn
import numpy as np

In [13]:
dados = pd.read_csv("train_set.csv")

In [14]:
lc = dados.shape
dados.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [19]:
dados.columns = ["ID","Sobreviveu","Classe","Nome","Sexo","Idade","Parentes","Familia","Passagem","Valor","Embarque"]

In [20]:
dados.head()

,ID,Sobreviveu,Classe,Nome,Sexo,Idade,Parentes,Familia,Passagem,Valor,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [21]:
dados.isnull().sum()

ID            0
Sobreviveu    0
Classe        0
Nome          0
Sexo          0
Idade         0
Parentes      0
Familia       0
Passagem      0
Valor         0
Embarque      0
dtype: int64

In [58]:
dados.groupby(["Valor"]).size()

Valor
0.0000      15
4.0125       1
5.0000       1
6.2375       1
6.4375       1
            ..
227.5250     4
247.5208     2
262.3750     2
263.0000     4
512.3292     3
Length: 248, dtype: int64

In [50]:
dados.groupby(["Idade"]).size()

Idade
0.42     1
0.67     1
0.75     2
0.83     2
0.92     1
        ..
70.00    2
70.50    1
71.00    2
74.00    1
80.00    1
Length: 89, dtype: int64

In [36]:
mediana = dados["Idade"].median()
mediana = round(mediana)

In [51]:
dados.loc[dados["Idade"] == 133.0] = mediana

In [53]:
mediana = dados["Valor"].median()
mediana = round(mediana)
print(mediana)

14

In [57]:
dados.loc[dados["Valor"] == 5012.3292] = 512.3292